{
    "name": "SureMembers",
    "slug": "suremembers",
    "author": "<a href='https://surecart.com'>SureCart</a>",
    "author_profile": "https://surecart.com/",
    "version": "1.10.9",
    "requires": "5.9",
    "tested": "6.8",
    "requires_php": "7.4",
    "sections": {
        "description": "A simple yet powerful way to add content restriction to your website.",
        "changelog": "<h4>1.10.9 - May 28, 2025</h4><ul><li>Fix: PHP error while accessing filter_content_meta_values() with 1 passed parameter, in case of checking access group's drip content.</li></ul><h4>1.10.8 - May 27, 2025</h4><ul><li>Improvement: SureDash compatibility added for spaces, groups, courses restrictions.</li><li>Improvement: Added Localization support to SureMembers for German and Spanish.</li><li>Improvement: Introducing a new filter 'suremembers_restrict_login_redirect_url' to modify the redirect URL for the login page.</li><li>Fix: PHP notice \"_load_textdomain_just_in_time was called incorrectly\" after WordPress 6.8 update.</li><li>Fix: Resolved the errors \"Call to a member function get_customer_id() on bool\" and \"Uncaught TypeError: array_search(): Argument #2 ($haystack) must be of type array, null given\" in the WooCommerce integration.</li></ul><h4>1.10.7 - February 18, 2025</h4><ul><li>Fix: Resolved the warning \"You attempted to edit an item that doesn't exist. Perhaps it was deleted?\" when editing any post/page.</li></ul><h4>1.10.6 - February 17, 2025</h4><ul><li>Fix: PHP notice \"_load_textdomain_just_in_time was called incorrectly\".</li><li>Fix: Extra \"a\" letter removed from email notification template.</li><li>Fix: The expiration date was not updated if the user was revoked access and then granted access again after a few days.</li><li>Fix: Fixed the issue where restricted content was accessible via the API.</li></ul><h4>1.10.5 - November 28, 2024</h4><ul><li>New: Added the suremembers_after_restricted_message_content action to display custom content after the restricted message section.</li><li>Improvement: Improved the code base to help achieve good compatibility with SureDash portal.</li></ul><h4>1.10.4 - November 21, 2024</h4><ul><li>Improvement: Updated the licensing library to fix error warnings related to PHP 8.2 version.</li><li>Fix: Fixed an error stopping orders from being permanently deleted.</li><li>Fix: The custom logo was not getting displayed on the wp-login page while using WordPress 6.7 version.</li><li>Fix: Fixed the issue with character encoding issue for email templates.</li></ul><h4>1.10.3 - June 25, 2024</h4><ul><li>Fix: In downloads section, all of the uploaded media files were not getting displayed due to pagination issue.</li><li>Fix: Fixed the logic to redirect and display the restriction message when the download file is viewed in non-logged in view.</li></ul><h4>1.10.2 - May 2, 2024</h4><ul><li>New: Added a access group expiry field in the users import example CSV file.</li><li>New: Introduced a filter `suremembers_restrict_login_redirect` to modify the redirect page URL for the checkout page of third-party plugins.</li><li>Fix: Fixed the user role sync and Drip content restriction use cases.</li></ul><h4>1.10.1 - April 15, 2024</h4><ul><li>Fix: The restricted message template was not getting displayed properly for the custom post type designed using Astra's Site Builder.</li><li>Fix: The drip content restriction feature was not working with user role sync setting.</li><li>Fix: Corrected the color picker display and alignment issue which was restricting to select the correct color in login customizer tab.</li><li>Improvement: Corrected the UI issue with the files selected in the downloads section in Access Group.</li></ul><h4>1.10.0 - March 21, 2024</h4><ul><li>New: Introduced the email notification feature for access groups.</li><li>New: Introduced the import the users feature via CSV file.</li></ul><h4>1.9.4 - March, 05, 2024</h4><ul><li>New: Showing the group ID on the access group list page for ease of use for the users.</li><li>Fix: Fixed the conflict between SureMembers and LatePoint plugins.</li><li>Fix: The single LearnDash courses were not getting restricted on the basis of rules selected.</li><li>Fix: Fixed array_search function called with an invalid argument.</li><li>Fix: Blog page was not getting restricted when it was set as post page.</li><li>Fix: Show password button was not working in the mobile views.</li></ul><h4>1.9.3 - December 14, 2023</h4><ul><li>New: Introduced new hooks to add extra meta-boxes to support third-party plugins.</li><li>Improvement: Updated the license library to it's latest version.</li><li>Fix: Resolved an issue where an empty value was causing errors in the strpos function.</li><li>Fix: Addressed a problem with the opening position of the date-picker for the Expiration date option.</li><li>Fix: Fixed the access expiration issue when the access is set to expire on the relative OR specific expiration dates.</li><li>Fix: Access restriction was not working on the basis of URL conditions.</li></ul><h4>1.9.2 - October 9, 2023</h4><ul><li>Fix: Fixed the login customizer redirect issue for showing 404 page in some cases.</li></ul><h4>1.9.1 - September 19, 2023</h4><ul><li>Improvement: Added compatibility for adding access groups to users when registered via Gravity Forms.</li><li>Fix: Fixed the issue that prevented clearing selected access groups in the WooCommerce product edit screen.</li><li>Fix: Fixed JS error that occurred when selecting a specific date in the drip date.</li><li>Fix: Updated BuddyBoss integration file load logic for better compatibility.</li></ul><h4>1.9.0 - September 5, 2023</h4><ul><li>Feature: Easily change the URL of the WP login form page.</li><li>Improvement: Added support for threaded access groups logic when using BuddyBoss components restriction with SureMembers.</li><li>Improvement: Added a new filter to control featured image display for restricted posts.</li></ul><h4>1.8.1 - August 18, 2023</h4><ul><li>Improvement: Optimized error layout and resolved BuddyBoss Theme issues in Login Popup.</li><li>Improvement: Added the ability to set expiration settings based on users directly from the profile page.</li><li>Improvement: Removed licensing popup and added licensing using API on the admin page.</li><li>Fix: Restricted the usage of special characters when creating, updating, and deleting user accounts.</li><li>Fix: Alert now appears when attempting to save a particular date and expiration date.</li><li>Fix: Unauthorized Access Button URL strips all content from non-English URLs.</li><li>Fix: Eliminate inactive or deleted access groups from the users list.</li><li>Fix: Modal Content not visible properly on restricted pages.</li></ul><h4>1.8.0 - June 2, 2023</h4><ul><li>Feature: Added a new feature that lets users choose a drip date to a specific date in the access group.</li><li>Improvement: Added compatibility for restricting BuddyBoss pages using URL restriction.</li><li>Improvement: Updated Download file's filename to inherit from the uploaded filename.</li><li>Fix: Fixed unable to delete or archive access group issue.</li></ul><h4>1.7.2 - April 28, 2023</h4><ul><li>Improvement: Added compatibility for new Elementor Containers to have support for block restriction option.</li></ul><h4>1.7.1 - April 24, 2023</h4><ul><li>Improvement: Added compatibility for BuddyBoss user registration and access group.</li><li>Improvement: Allow more than 10 downloads to be added to the access group.</li><li>Fix: Fixed Jetpack notification shortcut bug in the SureMembers edit page.</li><li>Fix: Changed Elementor widget access menu position to maintain uniformity.</li><li>Fix: Bug fixed that was causing the screen to go blank when using the login styler settings page.</li><li>Fix: Fixed the issue that was causing all downloads filename to be set as 'Download'.</li></ul><h4>1.7.0 - February 07, 2023</h4><ul><li>Feature: Prevent login sharing for chosen user roles.</li><li>Improvement: Updated admin icon SVG.</li><li>Fix: Resolved archive page restricted issue when all singulars rule was selected.</li></ul><h4>1.6.1 - January 16, 2023</h4><ul><li>Fix: Drip content was not working in the case of the Elementor template.</li><li>Fix: Issue with PostX and Kadance theme when activated together.</li><li>Fix: Elementor section content restriction was failing.</li></ul><h4>1.6.0 - December 27, 2022</h4><ul><li>Feature: Access Group expiration option.</li><li>Fix: Restricted menu item was not visible to site admins.</li><li>Fix: Block display condition was not showing in widgets screen.</li><li>Fix: Removed unwanted excerpt shown in the restricted message in Archive pages.</li></ul><h4>1.5.1 - December 8, 2022</h4><ul><li>Fix: Category name was missing in specific taxonomy/exclude selection.</li><li>Fix: Header was hidden on centralized rules engine popup.</li><li>Fix: Login page’s custom logo redirects issue.</li><li>Fix: Shadow was appearing on the transparent background login form.</li><li>Fix: Drip restriction was failing after certain days.</li></ul><h4>1.5.0 - December 6, 2022</h4><ul><li>Feature: Customize WordPress login page.</li><li>Improvement: Filters to modify post loop.</li><li>Improvement: SureMembers icon on admin bar for classic editor.</li><li>Fix: BuddyBoss infinite loading.</li><li>Fix: Warning on user's profile due to broken logo URL.</li><li>Fix: Drip time getting reset on save.</li><li>Fix: Code optimization and bug fixes.</li></ul><h4>1.4.0 - November 21, 2022</h4><ul><li>Feature: BuddyBoss API Integration.</li><li>Feature: Support for TutorLMS.</li><li>Feature: WooCommerce coupons integration with access groups.</li><li>Feature: Select default access groups for new registrations.</li><li>Improvement: SureTriggers compatibility.</li><li>Improvement: Customization option for hardcoded text labels.</li><li>Fix: PHP 8.0+ compatibility.</li></ul><h4>1.3.1 - November 9, 2022</h4><ul><li>Improvement: In content support for blog posts.</li><li>Improvement: Better restriction logic for all other post types.</li><li>Improvement: Centralized rules engine popup.</li><li>Fix: Login popup UI issues with Divi and other themes.</li><li>Fix: Redirection URLs were unrestricted.</li><li>Fix: PHP 8.0+ compatibility.</li><li>Fix: Compatibility with Mega Menu.</li></ul><h4>1.3.0 - October 21, 2022</h4><ul><li>Feature: Secure digital downloads.</li><li>Feature: Redirection rules.</li><li>Fix: Infinite redirect loop.</li><li>Fix: Administrator getting blocked using custom user role.</li><li>Fix: Issues with dynamic Gutenberg block rendering.</li></ul><h4>1.2.0 - October 11, 2022</h4><ul><li>Feature: Bulk edit access groups.</li><li>Improvement: Better URL restriction UI.</li><li>Improvement: URL restriction supports multiple regex rules.</li><li>Improvement: Option to restrict content in search results.</li><li>Improvement: Save access groups with empty rules.</li><li>Improvement: Custom restriction template for pages with post loop.</li><li>Fix: The elementor restriction widget is not working fine.</li><li>Fix: Issues with dynamic Gutenberg block rendering.</li><li>Fix: HTML entities not getting appropriately decoded.</li><li>Fix: Code optimization and bug fixes.</li></ul><h4>1.1.0 - September 27, 2022</h4><ul><li>Feature: Support for LearnDash.</li><li>Feature: WooCommerce Integration.</li><li>Feature: URL Restriction.</li><li>Feature: Create custom user roles.</li><li>Feature: Allow access group to User roles.</li><li>Feature: Show content if a user is in / not in an access group.</li><li>Feature: Login popup for unauthorized access.</li><li>Improvement: Suggestions for redirect URL.</li><li>Improvement: Search functionality for SureCart Integration</li><li>Improvement: Admin bar rules update by ajax on the front end.</li></ul><h4>1.0.3 - September 6, 2022</h4><ul><li>Improvement: Removed content restrictions for the administrator user role.</li><li>Improvement: Added AJAX for smooth centralized access group management in the admin bar.</li><li>Improvement: Added active state indication for the current page in the admin bar.</li><li>Fix: Fixed page redirection issue when the protocol is missing in the redirection URL.</li><li>Fix: Fixed PHP error in user access table when a user does not have access groups.</li></ul><h4>1.0.2 - September 2, 2022</h4><ul><li>Fix: Code optimization.</li></ul><h4>1.0.1 - September 1, 2022</h4><ul><li>Feature: Restrict child posts for hierarchical post types.</li><li>Improvement: Performance with assets loading.</li><li>Fix: Empty data populating in users table.</li></ul><h4>1.0.0 - August 26, 2022</h4><ul><li>Initial release.</li></ul>"
    }
}