{"translation-revision-date":"2025-03-12T20:46:18+00:00","generator":"WP-CLI\/2.11.0","source":"admin\/assets\/build\/globalsettings.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"en","plural-forms":"nplurals=2; plural=(n != 1);"},"Administrator":["Administrador"],"Access Groups":["Grupos de acceso"],"Archive":["Archivo"],"Un-Archive":["Desarchivar"],"Settings":["Configuración"],"Cancel":["Cancelar"],"Edit":["Editar"],"Delete":["Eliminar"],"Reset":["Restablecer"],"Apply":["Aplicar"],"Copy":["Copiar"],"File":["Archivo"],"New":["Nuevo"],"Archived":["Archivado"],"Save Access Group":["Guardar grupo de acceso"],"Error fetching media items: ":["Error al obtener elementos multimedia:"],"No items found":["No se encontraron elementos"],"Visibility":["Visibilidad"],"Added":["Agregado"],"Something went wrong. Please try again.":["Algo salió mal. Por favor, inténtalo de nuevo."],"Upload Media":["Subir medios"],"or drag and drop a file to upload.":["o arrastra y suelta un archivo para subirlo."],"Previous Page":["Página anterior"],"Next Page":["Página siguiente"],"SureMembers Media":["SureMembers Media"],"Private":["Privado"],"Public":["Público"],"Choose":["Elegir"],"Are you sure you wish to delete this media item? This cannot be undone.":["¿Está seguro de que desea eliminar este elemento multimedia? Esto no se puede deshacer."],"Preview Image":["Vista previa de la imagen"],"Filename":["Nombre del archivo"],"Size":["Tamaño"],"Remove":["Eliminar"],"Add Media":["Agregar medios"],"Title can't be empty":["El título no puede estar vacío"],"Search…":["Buscar…"],"Please add at least 1 character to search":["Por favor, añade al menos 1 carácter para buscar"],"Save Settings":["Guardar configuración"],"Admin Settings":["Configuración de administrador"],"Create User Roles":["Crear roles de usuario"],"Redirection Rules":["Reglas de redirección"],"Login Customizer":["Personalizador de inicio de sesión"],"Login Restrictions":["Restricciones de inicio de sesión"],"Text Labels":["Etiquetas de texto"],"Email Templates":["Plantillas de correo electrónico"],"Import":["Importar"],"Licensing":["Licencias"],"Created Roles":["Roles creados"],"Custom User Roles":["Roles de usuario personalizados"],"Create Custom User Roles. ( Please avoid using special symbols in the user roles. )":["Crear roles de usuario personalizados. ( Por favor, evite usar símbolos especiales en los roles de usuario. )"],"Update Role":["Actualizar rol"],"Create Role":["Crear rol"],"Confirm Remove":["Confirmar eliminación"],"Confirm":["Confirmar"],"Please enter the valid email ID to send the test email":["Por favor, introduce el ID de correo electrónico válido para enviar el correo de prueba"],"Test email send successfully":["Correo de prueba enviado con éxito"],"Copying.":["Copiando."],"Copied.":["Copiado."],"Failed.":["Fallido."],"From Name":["De Nombre"],"From Email":["De correo electrónico"],"Password Reset Email":["Correo Electrónico de Restablecimiento de Contraseña"],"Subject":["Asunto"],"Use WooCommerce's Template":["Usa la plantilla de WooCommerce"],"Content":["Contenido"],"Enter a Content…":["Introduce un contenido…"],"Send Test Email":["Enviar correo electrónico de prueba"],"New User Onboarding Email":["Correo Electrónico de Incorporación de Nuevo Usuario"],"Access Granted Email":["Correo de Acceso Concedido"],"Send test email.":["Enviar correo electrónico de prueba."],"Note:":["Nota:"],"Shortcodes used in the template will be updated with actual values for live emails.":["Los códigos cortos utilizados en la plantilla se actualizarán con valores reales para los correos electrónicos en vivo."],"Enter the email.":["Introduce el correo electrónico."],"Send Now":["Enviar ahora"],"Display SureMembers Icon on Block Editor":["Mostrar el icono de SureMembers en el editor de bloques"],"Toggle this option to enable\/disable the SureMembers icon display on the post\/page edit Gutenberg screen.":["Alterna esta opción para habilitar\/deshabilitar la visualización del icono de SureMembers en la pantalla de edición de publicaciones\/páginas de Gutenberg."],"Restrict content in search result":["Restringir contenido en el resultado de búsqueda"],"Restricting content in search result can be performance intensive. It is recommended to keep search results paginated.":["Restringir el contenido en los resultados de búsqueda puede ser intensivo en rendimiento. Se recomienda mantener los resultados de búsqueda paginados."],"Hide WooCommerce coupon input field":["Ocultar el campo de entrada de cupones de WooCommerce"],"If enabled, hides WooCommerce coupon input field on cart \/ checkout page .":["Si está habilitado, oculta el campo de entrada de cupones de WooCommerce en la página del carrito \/ pago."],"User Roles to Decline Admin Access":["Roles de usuario para rechazar el acceso de administrador"],"The user roles chosen in this option will not be able to access the WordPress admin dashboard, and the admin bar will be hidden. If a user with selected roles tries to access WP Admin Dashboard, it will redirect to the 404 page.":["Los roles de usuario elegidos en esta opción no podrán acceder al panel de administración de WordPress, y la barra de administración estará oculta. Si un usuario con los roles seleccionados intenta acceder al Panel de Administración de WP, será redirigido a la página 404."],"Assign access groups to new registrations":["Asignar grupos de acceso a nuevos registros"],"Selected access groups will be granted to new registrations.":["Los grupos de acceso seleccionados se otorgarán a los nuevos registros."],"CSV headers are not matched. Please check the CSV file and make sure it has the correct headers.":["Los encabezados del CSV no coinciden. Por favor, revise el archivo CSV y asegúrese de que tenga los encabezados correctos."],"Error processing CSV data. Please check the file format. Error: %s":["Error al procesar los datos CSV. Por favor, verifica el formato del archivo. Error: %s"],"Unknown error occurred.":["Ocurrió un error desconocido."],"No data found in the CSV file.":["No se encontraron datos en el archivo CSV."],"Import CSV":["Importar CSV"],"Import Users CSV gives you a powerful tool that lets you effortlessly bring in a bunch of users to your WordPress site from a CSV file. It's perfect for times when you need to add multiple users all at once!":["Importar Usuarios CSV te ofrece una herramienta poderosa que te permite incorporar sin esfuerzo a un grupo de usuarios a tu sitio de WordPress desde un archivo CSV. ¡Es perfecto para cuando necesitas agregar múltiples usuarios de una sola vez!"],"With this feature, you can easily enroll these users into specific access groups, making it convenient to manage their access.":["Con esta función, puedes inscribir fácilmente a estos usuarios en grupos de acceso específicos, lo que hace conveniente gestionar su acceso."],"Required Fields are: Username, Email ID":["Los campos obligatorios son: Nombre de usuario, ID de correo electrónico"],"Optional Fields are: Password, First Name, Last Name, Role, Suremember Access Groups, Access Group Expiration, Generate Password, Website.":["Los campos opcionales son: Contraseña, Nombre, Apellido, Rol, Grupos de Acceso de Suremember, Expiración del Grupo de Acceso, Generar Contraseña, Sitio Web."],"To download the .CSV template":["Para descargar la plantilla .CSV"],"click here.":["haz clic aquí."],"Send password reset email to all the users.":["Enviar correo electrónico de restablecimiento de contraseña a todos los usuarios."],"Send onboarding email to users.":["Enviar correo electrónico de incorporación a los usuarios."],"Upload":["Subir"],"Click here":["Haz clic aquí"]," to view more info. ":["para ver más información."],"Please Enter License Key.":["Por favor, introduzca la clave de licencia."],"License Key":["Clave de licencia"],"Please Enter your License Key.":["Por favor, introduzca su clave de licencia."],"Activate License":["Activar licencia"],"License Successfully Activated.":["Licencia activada con éxito."],"Deactivate License":["Desactivar licencia"],"Login URL":["URL de inicio de sesión"],"Customize your websites login url from wp-login.php to one of your choosing.":["Personaliza la URL de inicio de sesión de tu sitio web de wp-login.php a una de tu elección."],"Customize Login URL":["Personalizar URL de inicio de sesión"],"Redirect URL:":["Redirigir URL:"],"Brand Colors":["Colores de la marca"],"Primary Color":["Color primario"],"This color will be the primary color.":["Este color será el color principal."],"Secondary Color":["Color secundario"],"This color will be used as secondary color.":["Este color se usará como color secundario."],"Text Color":["Color del texto"],"This color will be used as text color.":["Este color se usará como color de texto."],"Links Color":["Color de los enlaces"],"This color will be used as links color.":["Este color se usará como color de los enlaces."],"Logo Settings":["Configuración del logotipo"],"Disable Logo":["Desactivar logotipo"],"Toggle this option to disable logo in login page.":["Activa esta opción para desactivar el logotipo en la página de inicio de sesión."],"Custom Logo":["Logotipo personalizado"],"Toggle this option to enable the custom logo replacing the WordPress logo in login page.":["Activa esta opción para habilitar el logo personalizado que reemplaza el logo de WordPress en la página de inicio de sesión."],"Logo Width":["Ancho del logotipo"],"Logo Height":["Altura del logotipo"],"Logo Image":["Imagen del logotipo"],"Add Logo":["Agregar logotipo"],"Replace":["Reemplazar"],"Login Form":["Formulario de inicio de sesión"],"Enable Transparent Form":["Habilitar formulario transparente"],"Toggle this option to remove background color and border from login form.":["Activa esta opción para eliminar el color de fondo y el borde del formulario de inicio de sesión."],"Background Color":["Color de fondo"],"This color will be the login form background color.":["Este color será el color de fondo del formulario de inicio de sesión."],"Border Color":["Color del borde"],"This color will be used as the login form border color.":["Este color se usará como el color del borde del formulario de inicio de sesión."],"Background Settings":["Configuración de fondo"],"Enable Background Image":["Habilitar imagen de fondo"],"Toggle this option to enable\/disable background image.":["Alterna esta opción para habilitar\/deshabilitar la imagen de fondo."],"Background Repeat:":["Repetir fondo:"],"Repeat":["Repetir"],"repeat-x":["repetir-x"],"repeat-y":["repetir-y"],"No Repeat":["No repetir"],"Initial":["Inicial"],"Inherit":["Heredar"],"Select Position:":["Seleccionar posición:"],"Left Top":["Superior izquierdo"],"Left Center":["Centro Izquierdo"],"Left Bottom":["Inferior izquierdo"],"Right Top":["Parte superior derecha"],"Right Center":["Centro Derecho"],"Right Bottom":["Inferior derecho"],"Center Top":["Centro Superior"],"Center":["Centro"],"Center Bottom":["Centro Inferior"],"Background Image Size:":["Tamaño de la imagen de fondo:"],"Auto":["Auto"],"Cover":["Cubrir"],"Contain":["Contener"],"Background Image":["Imagen de fondo"],"Add Background":["Agregar fondo"],"This color will be used as background color.":["Este color se usará como color de fondo."],"Type to search existing posts or copy paste external URL.":["Escribe para buscar publicaciones existentes o copia y pega la URL externa."],"Login Redirect":["Redirección de inicio de sesión"],"Type to search existing posts or copy paste external URL":["Escribe para buscar publicaciones existentes o copia y pega una URL externa"],"Logout Redirect":["Redirección de cierre de sesión"],"All Roles":["Todos los roles"],"Are you sure you want to delete this restriction?":["¿Está seguro de que desea eliminar esta restricción?"],"Delete Restriction":["Eliminar restricción"],"User Roles":["Roles de usuario"],"Max Concurrent Logins":["Inicios de sesión concurrentes máximos"],"active logins":["inicios de sesión activos"],"Login Logic":["Lógica de inicio de sesión"],"Choose \"Allow\" to allow new login by terminating all other old sessions when the limit is reached OR choose \"Block\" to not allow new login if the limit is reached. Users need to wait for the old login sessions to expire.":["Elige \"Permitir\" para permitir un nuevo inicio de sesión terminando todas las demás sesiones antiguas cuando se alcance el límite O elige \"Bloquear\" para no permitir un nuevo inicio de sesión si se alcanza el límite. Los usuarios deben esperar a que las sesiones de inicio de sesión antiguas expiren."],"Allow New User Login":["Permitir el inicio de sesión de nuevos usuarios"],"Block New User Login":["Bloquear el inicio de sesión de nuevos usuarios"],"Allow logouts":["Permitir cierres de sesión"],"Toggle this option to allow users to logout from all other devices.":["Activa esta opción para permitir que los usuarios cierren sesión en todos los demás dispositivos."],"Add Login Restriction":["Agregar restricción de inicio de sesión"]}}}